Product/Production/Gateway/AggregatorCA/test/DocRetrieveStartTransaction/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:gov:hhs:fha:nhinc:gateway:aggregator" xmlns:urn1="urn:ihe:iti:xds-b:2007">
  <soapenv:Body>
    <urn:StartTransactionDocRetrieveRequest>
      <urn:retrieveDocumentSetRequest>
        <!--1 or more repetitions:-->
        <urn1:DocumentRequest>
          <!--Optional:-->
          <urn1:HomeCommunityId>1.1</urn1:HomeCommunityId>
          <urn1:RepositoryUniqueId>1.2</urn1:RepositoryUniqueId>
          <urn1:DocumentUniqueId>1.3</urn1:DocumentUniqueId>
        </urn1:DocumentRequest>
      </urn:retrieveDocumentSetRequest>
    </urn:StartTransactionDocRetrieveRequest>
  </soapenv:Body>
</soapenv:Envelope>