Current/Product/Production/Gateway/AggregatorCA/test/DocQueryStartTransaction/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:gov:hhs:fha:nhinc:gateway:aggregator" xmlns:urn1="urn:gov:hhs:fha:nhinc:common:nhinccommon">
  <soapenv:Body>
    <urn:StartTransactionDocQueryRequest>
      <urn:qualifiedPatientIdentifiers>
        <!--Zero or more repetitions:-->
        <urn1:QualifiedSubjectIdentifier>
          <urn1:SubjectIdentifier>1234</urn1:SubjectIdentifier>
          <urn1:AssiginingAuthorityIdentifier>1.1</urn1:AssiginingAuthorityIdentifier>
        </urn1:QualifiedSubjectIdentifier>
      </urn:qualifiedPatientIdentifiers>
    </urn:StartTransactionDocQueryRequest>
  </soapenv:Body>
</soapenv:Envelope>